tukano-artillery-tests/users.yaml
# Create Users
config:
  target:  http://74.178.105.240/tukano/tukano-1/rest
  plugins:
    metrics-by-endpoint: { } # Used to get metrics for each endpoint individually.
  phases:
    - name: "Main test"    # MAIN TESTS: duration: 30s, with 1 new clients/sec
      duration: 30
      arrivalRate: 5
  payload:
    path: ./data/updated_users.csv
    #loadAll: true # load the whole CSV
    order: sequence # selects users sequentially, default is random
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
      - "random_user_id"
scenarios:
  - name: 'Create Users'
    weight: 1
    flow:
      # Create users
      - post:
          url: /users/
          headers:
            Content-Type: application/json
          json:
            userId: "{{ userId }}"
            pwd: "{{ pwd }}"
            email: "{{ email }}"
            displayName: "{{ displayName }}"